# todo: Определить в коде переменные:
# 1. Целочисленного типа
# 2. Вещественного типа
# 3. Логического типа
# 4. Строкового типа
# 5. Пустого типа
# Вывести их типы.

a = 1
b = 1.1
c = True
d = "abc"
#пустой тип это какой?
print (type(a), type(b), type(c), type (d))