#todo: Написать программу, которая считывает два числа и выводит их сумму, разность, частное, произведение,
# результат целочисленного деления, результат деления с остатком, результат возведения в степень.
a = int(input("введите a " ))
b = int(input("введите b " ))
print ( "a + b =",a+b,
        "a - b =",a-b,
        "a / b =",a/b,
        "a * b =",a*b,
        "a % b =",a%b,
        "a // b =",a//b,
        "a ** b =",a**b,
        "b ** a =",b**a  )
 #как сделать с каждой строки?